zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT600/MIMXRT685S/MIMXRT685S_dsp_COMMON.h
/*
** ###################################################################
**     Processors:          MIMXRT685SFAWBR_dsp
**                          MIMXRT685SFFOB_dsp
**                          MIMXRT685SFVKB_dsp
**                          MIMXRT685SVFVKB_dsp
**
**     Compiler:            Xtensa Compiler
**     Reference manual:    MIMXRT685 User manual Rev. 1.8 21 November 2024
**     Version:             rev. 4.0, 2025-11-13
**     Build:               b260509
**
**     Abstract:
**         Peripheral Access Layer for MIMXRT685S_dsp
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2018-06-19)
**         Initial version.
**     - rev. 2.0 (2019-11-12)
**         Base on rev 0.95 RM (B0 Header)
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-11-13)
**         Add puf irq and move some trng compatibility macros to common header.
**
** ###################################################################
*/

/*!
 * @file MIMXRT685S_dsp_COMMON.h
 * @version 4.0
 * @date 2025-11-13
 * @brief Peripheral Access Layer for MIMXRT685S_dsp
 *
 * Peripheral Access Layer for MIMXRT685S_dsp
 */

#if !defined(MIMXRT685S_DSP_COMMON_H_)
#define MIMXRT685S_DSP_COMMON_H_                 /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0400U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U

/* ----------------------------------------------------------------------------
   --
   ---------------------------------------------------------------------------- */

/* IO definitions (access restrictions to peripheral registers) */
/**
    \defgroup CMSIS_glob_defs CMSIS Global Defines
    <strong>IO Type Qualifiers</strong> are used
    \li to specify the access to peripheral variables.
    \li for automatic generation of peripheral register debug information.
*/
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

#define __STATIC_INLINE static inline

#define __BKPT(value) do {} while(0)
#define __NOP() do {} while(0)

#include "system_MIMXRT685S_dsp.h"     /* Device specific configuration file */



/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 67                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Device specific interrupts */
  NonMaskableInt_IRQn          = 0,                /**< SysIRQ, Non Maskable Interrupt */
  Software_IRQn                = 1,                /**< Software triggered Interrupt */
  RtosTimer0_IRQn              = 2,                /**< Internal RTOS Timer0 Interrupt */
  RtosTimer1_IRQn              = 3,                /**< Internal RTOS Timer1 Interrupt */
  Profiling_IRQn               = 4,                /**< Profiling Interrupt */
  DSP_INT0_SEL0_IRQn           = 5,                /**< Interrupt selected by DSP_INT0_SEL0 */
  DSP_INT0_SEL1_IRQn           = 6,                /**< Interrupt selected by DSP_INT0_SEL1 */
  DSP_INT0_SEL2_IRQn           = 7,                /**< Interrupt selected by DSP_INT0_SEL2 */
  DSP_INT0_SEL3_IRQn           = 8,                /**< Interrupt selected by DSP_INT0_SEL3 */
  DSP_INT0_SEL4_IRQn           = 9,                /**< Interrupt selected by DSP_INT0_SEL4 */
  DSP_INT0_SEL5_IRQn           = 10,               /**< Interrupt selected by DSP_INT0_SEL5 */
  DSP_INT0_SEL6_IRQn           = 11,               /**< Interrupt selected by DSP_INT0_SEL6 */
  DSP_INT0_SEL7_IRQn           = 12,               /**< Interrupt selected by DSP_INT0_SEL7 */
  DSP_INT0_SEL8_IRQn           = 13,               /**< Interrupt selected by DSP_INT0_SEL8 */
  DSP_INT0_SEL9_IRQn           = 14,               /**< Interrupt selected by DSP_INT0_SEL9 */
  DSP_INT0_SEL10_IRQn          = 15,               /**< Interrupt selected by DSP_INT0_SEL10 */
  DSP_INT0_SEL11_IRQn          = 16,               /**< Interrupt selected by DSP_INT0_SEL11 */
  DSP_INT0_SEL12_IRQn          = 17,               /**< Interrupt selected by DSP_INT0_SEL12 */
  DSP_INT0_SEL13_IRQn          = 18,               /**< Interrupt selected by DSP_INT0_SEL13 */
  DSP_INT0_SEL14_IRQn          = 19,               /**< Interrupt selected by DSP_INT0_SEL14 */
  DSP_INT0_SEL15_IRQn          = 20,               /**< Interrupt selected by DSP_INT0_SEL15 */
  DSP_INT0_SEL16_IRQn          = 21,               /**< Interrupt selected by DSP_INT0_SEL16 */
  DSP_INT0_SEL17_IRQn          = 22,               /**< Interrupt selected by DSP_INT0_SEL17 */
  DSP_INT0_SEL18_IRQn          = 23,               /**< Interrupt selected by DSP_INT0_SEL18 */
  DSP_INT0_SEL19_IRQn          = 24,               /**< Interrupt selected by DSP_INT0_SEL19 */
  DSP_INT0_SEL20_IRQn          = 25,               /**< Interrupt selected by DSP_INT0_SEL20 */
  DSP_INT0_SEL21_IRQn          = 26,               /**< Interrupt selected by DSP_INT0_SEL21 */
  DSP_INT0_SEL22_IRQn          = 27,               /**< Interrupt selected by DSP_INT0_SEL22 */
  DSP_INT0_SEL23_IRQn          = 28,               /**< Interrupt selected by DSP_INT0_SEL23 */
  DSP_INT0_SEL24_IRQn          = 29,               /**< Interrupt selected by DSP_INT0_SEL24 */
  DSP_INT0_SEL25_IRQn          = 30,               /**< Interrupt selected by DSP_INT0_SEL25 */
  DSP_INT0_SEL26_IRQn          = 31,               /**< Interrupt selected by DSP_INT0_SEL26 */
  FLEXCOMM0_IRQn               = 32,               /**< Flexcomm Interface 0 (USART, SPI, I2C, I2S)(DSP_INT_SELn source IRQ0) */
  FLEXCOMM1_IRQn               = 33,               /**< Flexcomm Interface 1 (USART, SPI, I2C, I2S)(DSP_INT_SELn source IRQ1) */
  FLEXCOMM2_IRQn               = 34,               /**< Flexcomm Interface 2 (USART, SPI, I2C, I2S)(DSP_INT_SELn source IRQ2) */
  FLEXCOMM3_IRQn               = 35,               /**< Flexcomm Interface 3 (USART, SPI, I2C, I2S)(DSP_INT_SELn source IRQ3) */
  FLEXCOMM4_IRQn               = 36,               /**< Flexcomm Interface 4 (USART, SPI, I2C, I2S)(DSP_INT_SELn source IRQ4) */
  FLEXCOMM5_IRQn               = 37,               /**< Flexcomm Interface 5 (USART, SPI, I2C, I2S)(DSP_INT_SELn source IRQ5) */
  FLEXCOMM6_IRQn               = 38,               /**< Flexcomm Interface 6 (USART, SPI, I2C, I3S)(DSP_INT_SELn source IRQ6) */
  FLEXCOMM7_IRQn               = 39,               /**< Flexcomm Interface 7 (USART, SPI, I2C, I4S)(DSP_INT_SELn source IRQ7) */
  PIN_INT0_IRQn                = 40,               /**< Pin interrupt 0 or pattern match engine slice 0 int(DSP_INT_SELn source IRQ8) */
  PIN_INT1_IRQn                = 41,               /**< Pin interrupt 1 or pattern match engine slice 1 int(DSP_INT_SELn source IRQ9) */
  PIN_INT2_IRQn                = 42,               /**< Pin interrupt 2 or pattern match engine slice 2 int(DSP_INT_SELn source IRQ10) */
  PIN_INT3_IRQn                = 43,               /**< Pin interrupt 3 or pattern match engine slice 3 int(DSP_INT_SELn source IRQ11) */
  PIN_INT4_IRQn                = 44,               /**< Pin interrupt 4 or pattern match engine slice 4 int(DSP_INT_SELn source IRQ12) */
  PIN_INT5_IRQn                = 45,               /**< Pin interrupt 5 or pattern match engine slice 5 int(DSP_INT_SELn source IRQ13) */
  PIN_INT6_IRQn                = 46,               /**< Pin interrupt 6 or pattern match engine slice 6 int(DSP_INT_SELn source IRQ14) */
  PIN_INT7_IRQn                = 47,               /**< Pin interrupt 7 or pattern match engine slice 7 int(DSP_INT_SELn source IRQ15) */
  GPIO_INTA_IRQn               = 48,               /**< GPIO interrupt A(DSP_INT_SELn source IRQ16) */
  GPIO_INTB_IRQn               = 49,               /**< GPIO interrupt B(DSP_INT_SELn source IRQ17) */
  WDT1_IRQn                    = 50,               /**< Windowed watchdog timer 1 (HiFi 4 watchdog)(DSP_INT_SELn source IRQ18) */
  DMA0_IRQn                    = 51,               /**< DMA controller 0 (secure or CM33 DMA)(DSP_INT_SELn source IRQ19) */
  DMA1_IRQn                    = 52,               /**< DMA controller 1 (non-secure or HiFi 4 DMA)(DSP_INT_SELn source IRQ20) */
  MU_B_IRQn                    = 53,               /**< Messaging Unit port B for HiFi 4(DSP_INT_SELn source IRQ21) */
  UTICK0_IRQn                  = 54,               /**< Micro-tick Timer(DSP_INT_SELn source IRQ22) */
  MRT0_IRQn                    = 55,               /**< Multi-Rate Timer(DSP_INT_SELn source IRQ23) */
  OS_EVENT_IRQn                = 56,               /**< OS event timer(DSP_INT_SELn source IRQ24) */
  CTIMER0_IRQn                 = 57,               /**< Standard counter/timer CTIMER0(DSP_INT_SELn source IRQ25) */
  CTIMER1_IRQn                 = 58,               /**< Standard counter/timer CTIMER1(DSP_INT_SELn source IRQ26) */
  CTIMER2_IRQn                 = 59,               /**< Standard counter/timer CTIMER2(DSP_INT_SELn source IRQ27) */
  CTIMER3_IRQn                 = 60,               /**< Standard counter/timer CTIMER3(DSP_INT_SELn source IRQ28) */
  CTIMER4_IRQn                 = 61,               /**< Standard counter/timer CTIMER4(DSP_INT_SELn source IRQ29) */
  RTC_IRQn                     = 62,               /**< RTC alarm and wake-up(DSP_INT_SELn source IRQ30) */
  I3C0_IRQn                    = 63,               /**< I3C interface 0(DSP_INT_SELn source IRQ31) */
  DMIC0_IRQn                   = 64,               /**< Digital microphone and DMIC subsystem(DSP_INT_SELn source IRQ32) */
  HWVAD0_IRQn                  = 65,               /**< Hardware Voice Activity Detector(DSP_INT_SELn source IRQ33) */
  FLEXSPI_IRQn                 = 66                /**< FLEXSPI interface(DSP_INT_SELn source IRQ34) */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


#ifndef MIMXRT685S_dsp_SERIES
#define MIMXRT685S_dsp_SERIES
#endif
/* CPU specific feature definitions */
#include "MIMXRT685S_dsp_features.h"

/* ADC - Peripheral instance base addresses */
/** Peripheral ADC0 base address */
#define ADC0_BASE                                (0x4013A000u)
/** Peripheral ADC0 base pointer */
#define ADC0                                     ((ADC_Type *)ADC0_BASE)
/** Array initializer of ADC peripheral base addresses */
#define ADC_BASE_ADDRS                           { ADC0_BASE }
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            { ADC0 }

/* CACHE64_CTRL - Peripheral instance base addresses */
/** Peripheral CACHE64 base address */
#define CACHE64_BASE                             (0x40033000u)
/** Peripheral CACHE64 base pointer */
#define CACHE64                                  ((CACHE64_CTRL_Type *)CACHE64_BASE)
/** Array initializer of CACHE64_CTRL peripheral base addresses */
#define CACHE64_CTRL_BASE_ADDRS                  { CACHE64_BASE }
/** Array initializer of CACHE64_CTRL peripheral base pointers */
#define CACHE64_CTRL_BASE_PTRS                   { CACHE64 }
/* Backward compatibility */
#define CACHE64_CTRL_CSAR_PHYADDR_MASK (CACHE64_CTRL_CSAR_PHYADDR27_1_MASK | CACHE64_CTRL_CSAR_PHYADDR31_29_MASK)


/* CACHE64_POLSEL - Peripheral instance base addresses */
/** Peripheral CACHE64_POLSEL base address */
#define CACHE64_POLSEL_BASE                      (0x40033000u)
/** Peripheral CACHE64_POLSEL base pointer */
#define CACHE64_POLSEL                           ((CACHE64_POLSEL_Type *)CACHE64_POLSEL_BASE)
/** Array initializer of CACHE64_POLSEL peripheral base addresses */
#define CACHE64_POLSEL_BASE_ADDRS                { CACHE64_POLSEL_BASE }
/** Array initializer of CACHE64_POLSEL peripheral base pointers */
#define CACHE64_POLSEL_BASE_PTRS                 { CACHE64_POLSEL }

/* CLKCTL0 - Peripheral instance base addresses */
/** Peripheral CLKCTL0 base address */
#define CLKCTL0_BASE                             (0x40001000u)
/** Peripheral CLKCTL0 base pointer */
#define CLKCTL0                                  ((CLKCTL0_Type *)CLKCTL0_BASE)
/** Array initializer of CLKCTL0 peripheral base addresses */
#define CLKCTL0_BASE_ADDRS                       { CLKCTL0_BASE }
/** Array initializer of CLKCTL0 peripheral base pointers */
#define CLKCTL0_BASE_PTRS                        { CLKCTL0 }

/* CLKCTL1 - Peripheral instance base addresses */
/** Peripheral CLKCTL1 base address */
#define CLKCTL1_BASE                             (0x40021000u)
/** Peripheral CLKCTL1 base pointer */
#define CLKCTL1                                  ((CLKCTL1_Type *)CLKCTL1_BASE)
/** Array initializer of CLKCTL1 peripheral base addresses */
#define CLKCTL1_BASE_ADDRS                       { CLKCTL1_BASE }
/** Array initializer of CLKCTL1 peripheral base pointers */
#define CLKCTL1_BASE_PTRS                        { CLKCTL1 }

/* CMP - Peripheral instance base addresses */
/** Peripheral CMP base address */
#define CMP_BASE                                 (0x40139000u)
/** Peripheral CMP base pointer */
#define CMP                                      ((CMP_Type *)CMP_BASE)
/** Array initializer of CMP peripheral base addresses */
#define CMP_BASE_ADDRS                           { CMP_BASE }
/** Array initializer of CMP peripheral base pointers */
#define CMP_BASE_PTRS                            { CMP }

